IDENTIFICATION DIVISION.
PROGRAM-ID. EXEMPLO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 I PIC 99 VALUE 1.
01 NUMERO PIC 999.
01 RESULTADO PIC 9(5).

PROCEDURE DIVISION.
    DISPLAY "Digite um numero: ".
    ACCEPT NUMERO.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
        COMPUTE RESULTADO = I * NUMERO
        DISPLAY NUMERO " x " DISPLAY  " = " RESULTADO
    END-PERFORM.

    STOP RUN.